# # Pandas - Missing Data

In [2]:
import numpy as np
import pandas as pd

In [3]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'c':[1,2,3]}

In [4]:
df = pd.DataFrame(d)

In [5]:
df

     A    B  c
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

If we want to delete the row(axis=0) and columns(axis=1) containing 1 or more than 1 null values.

In [6]:
# Deleting the rows
df.dropna()

     A    B  c
0  1.0  5.0  1

In [7]:
# ropping the columns
df.dropna(axis=1)

   c
0  1
1  2
2  3

Setting the threshold value, which means that specifying the number of non-Null we want, so excceding the value will drop that particulat rows/columns

In [9]:
# Meaning there must be atleat 2 non-Null value
df.dropna(thresh=2)

     A    B  c
0  1.0  5.0  1
1  2.0  NaN  2

# # Replacing the missing values

In [10]:
df

     A    B  c
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [11]:
df.fillna(value='FILL VALUE')

            A           B  c
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

Now setting the missing value to mean to the column

In [12]:
df['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [13]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64